app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "Charles"], ["content", "Clap de Fin"], ["created_at", "2018-04-30 17:19:44.245217"], ["updated_at", "2018-04-30 17:19:44.245217"]]
---
	def create
		@gossip=Gossip.create(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
---
	def show
		@gossip = Gossip.find_by(id: params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@gossip = Gossip.find_by(id: params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "gossips" SET "anonymous_author" = ?, "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["anonymous_author", "James Bond"], ["content", "Vesper Martini!! Shaker please"], ["updated_at", "2018-05-01 13:29:05.188413"], ["id", 21]]
---
	def update
		@gossip = Gossip.find_by(id: params[:id])
		@gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 30]]
---
	def destroy
		@gossip = Gossip.find_by(id: params[:id])
		@gossip.destroy